app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "phone", "updated_at", "zip") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Sun, 03 Nov 2013 14:22:17 UTC +00:00], ["email", "tuanduong15@gmail.com"], ["name", "T"], ["phone", "t"], ["updated_at", Sun, 03 Nov 2013 14:22:17 UTC +00:00], ["zip", "22191"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "zip" = $1, "email" = $2, "phone" = $3, "updated_at" = $4 WHERE "users"."id" = 1  [["zip", 22191], ["email", "tuanduong@tuan.com"], ["phone", 2403771410], ["updated_at", Sun, 03 Nov 2013 00:17:10 UTC +00:00]]